// MyProject.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//
//公众号：程序员速成   ，内含优质视频教程，欢迎关注

//#include "stdio.h"  写不写都可以
#include <iostream>

#pragma warning(disable : 4996) //让编译器忽略一些警告信息，从而让我们可以正常使用scanf()等函数


//函数声明开始-----------------------------------------------------------------
void printhello();
int addtwoshu(int a, int b);

void qtfunc1();
void qtfunc2();
void qtfunc3();
//函数声明结束-----------------------------------------------------------------


int main()
{
	{
		//函数调用开始---------------------------------------------------------
		printhello();  //hello,how are you!
		printf("a+b=%d\n", addtwoshu(5, 6)); //a+b=11
		//函数调用结束---------------------------------------------------------
	}	
	{
		qtfunc1();

	}


	return 0;
}

//函数定义开始------------------------------------------------------------------
void printhello() //自定义的函数（咱们自己写的函数）
{	
	printf("hello,how are you!\n");
}
int addtwoshu(int a, int b)
{
	return a + b; //直接返回一个表达式，这也是完全可以的；
}

void qtfunc1()
{
	printf("qtfunc1开始执行()------------\n");
	qtfunc2(); //函数调用
	printf("qtfunc1结束执行()------------\n");
}

void qtfunc2()
{
	printf("qtfunc2开始执行()------------\n");
	qtfunc3(); //函数调用
	printf("qtfunc2结束执行()------------\n");
}
void qtfunc3()
{
	printf("qtfunc3开始执行()------------\n");
	printf("qtfunc3结束执行()------------\n");
}

//函数定义结束------------------------------------------------------------------


// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门提示: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
