// MyProject.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//
//公众号：程序员速成   ，内含优质视频教程，欢迎关注

//#include "stdio.h"  写不写都可以
#include <iostream>

#pragma warning(disable : 4996) //让编译器忽略一些警告信息，从而让我们可以正常使用scanf()等函数

int main()
{	
	{
		printf("5>3的值为%d\n", 5 > 3); //1
	}
	{
		if (true == 1)
		{
			printf("true==1\n"); //这行会执行
		}
		else
		{
			printf("true!=1\n"); //这行不会执行
		}
	}
	{
		int a = 3, b = 2, c = 1;
		printf("%d\n", (a > b) == c); //1，其实就是"真"
		printf("%d\n", b + c < a);    //0，其实就是"假"
	}
	{
		printf("4==true，结果为：%d\n", 4 == true);  //0
		printf("1==true，结果为：%d\n", 1 == true);  //1
		printf("4 && 5，结果为：%d\n", 4 && 5);  //1
	}
	{
		printf("'c' && 'd'，结果为：%d\n", 'c' && 'd');  //1
	}
	{
		int a = 1;
		if (3 < 5 && (a = 8))   //执行后a = 多少？
		{
		}
		printf("a = %d\n",a);  //8		
	}
	{
		int a = 1;
		if (3 > 5 && (a = 8))   //执行 后a = 多少
		{
		}
		printf("a = %d\n", a);  //1
	}
	{
		int a = 1;
		if (3 > 5 || (a = 8))  //执行后a =多少
		{
		}
		printf("a = %d\n", a);  //8

	}

	{
		int a = 1;
		if (3 < 5 || (a = 8))  //执行后a =多少
		{
		}
		printf("a = %d\n", a);//1
	}

}


// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门提示: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
