// MyProject.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//
//公众号：程序员速成   ，内含优质视频教程，欢迎关注
#include <iostream>

int main()
{		
	{
		//实型常量
		168E+2;
		168E-8;
		168e+2;
		168e-8;
		int abc;
		abc = 1;

		//实型变量
		float d, e, f;
		double i, k;
	}

	{
		float af;
		double bf;
		af = 1111111.111;
		bf = 1111111.111;
		//printf("断点可以掐到这行");
	}
	{
		float af;  //有效数是7位吗
		af = 1234567898.1234;
		//printf("断点可以掐到这行");
	}

	{
		float af = 12.34567291234987654321;  //查看有效位是多少
		double ad = 12.34567291234987654321; //查看有效位是多少。
		//printf("af的值是%f\n", af);
		//printf("ad的值是%f\n", ad);
	}
	{
		float af = 12.34567291234987654321;  //查看有效位是多少
		double ad = 12.34567291234987654321; //查看有效位是多少。
		//printf("af的值是%.20f\n", af);
		//printf("ad的值是%.20f\n", ad);
	}
	{
		float af1 = 0.5;  //显示0.50000000
		float af2 = 0.51; //显示0.509999990,它为什么显示的不是0.51000000，丢失了精度。
		//printf("断点可以掐到这行");
	}
	{
		printf("abc\ndef\'ghi\"jkl");
	}
	{
		char c1, c2, c3;
		c1 = 'a';		
		c2 = 'b';
		c3 = '\'';
	}
	{
		char c1, c2;
		c1 = 97;  //相当于c1 = 'a';
		c2 = 98;  //相当于c2 = 'b';
		printf("c1 = %c,c2 = %c\n", c1, c2);  //c1 = a,c2 = b
		printf("c1 = %d,c2 = %d\n", c1, c2);  //c1 = 97,c2 = 98
		c2 = c2 + 4;
		printf("c1 = %c,c2 = %c\n", c1, c2);  //c1 = a,c2 = b
		printf("c1 = %d,c2 = %d\n", c1, c2);  // c1 = 97,c2 = 98
	}
	{
		printf("老师好，各位亲爱的同学们你们好\n");
	}
	{
		printf("abcdefg\0hij"); //abcdefg
	}
	{
		char aaa[1000] = "safasdfa\0def";
		printf(aaa);
	}
	{
		int q = 3;
		int a, b, c = 6;  //一行定义多个变量，其中给变量c一个初值。
		//printf("断点可以掐到这行\n");
	}

	{
		int a = 500;
		double ad = 15.67;
		double de = a + ad;
		printf("结果为%f",de); //结果为515.670000
	}

	{
		float aaa = 1234567.8901 + 1234567.8901;
		printf("断点可以掐到这行\n");
	}
	
}


// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门提示: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
