// MyProject.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//
//公众号：程序员速成   ，内含优质视频教程，欢迎关注
#include <iostream>

int main()
{		
	{
		int a;
		a = 5;
		a = 6.5; //将实型数据给整型变量时，小数部分就被舍弃了。a = 6了。
		a = 18 + 50; //先计算等号右边表达式的值，再赋值给等号左边变量，这是由运算符优先级决定的，因为赋值运算符=的优先级低与加法运算符+；
	}

	{
		char a;
		a = 900; //溢出结果的演示，大家要充分考虑到一个类型的取值范围，因为溢出得到的结果显然不是大家想要的结果；
		printf("断点掐到这里方便观察结果\n");
	}

	{
		int a;
		a = 1000000 * 1000000; //每个值都不会溢出，但结果会溢出，这也不行。结果变得不可预料。这是容易犯的错，每个子值都不溢出，但整个计算结果却是溢出的。
		printf("断点掐到这里方便观察结果\n");
	}
	{
		int a = 6;
		a += 8;
		printf("a = %d\n",a); //a = 14
	}

	//赋值表达式的值
	{
		int a;
		printf("a = 5这个赋值表达式的值是%d\n", a = 5); //a = 5这个赋值表达式的值是5
	}
	{
		int a, b;
		a = (b = 5); //其实就相当于了 a = 5;
		printf("断点掐到这里方便观察结果\n");
	}
	{
		int a = 3;
		a += (a -= (a * a));
		printf("a = %d\n", a); //a = -12
	}
	{
		int a = 3;
		a += (a -= (a * a));  //a = -12
		a += (a -= 9);        //a = -42
		a += (a = a - 9);     //a = -102
		a += (a = 3 - 9);     //a = -12
		a += (a = (-6));      //a = -12
		a += (-6);            //a = -18
		a = a + (-6);         //a = -24
		printf("断点掐到这里方便观察结果\n");
	}
	{
		int a;
		a = (4, 5);   //a = 5，因为逗号表达式优先级太低，所以必须加()
		a = (3 + 5, 6 + 8); //a = 14
		printf("a的值 = %d，整个逗号表达式的值 = %d\n",a = 3 * 5, a * 4); 		
	}
	{
		int x,a;		
		x = (a = 3, 6 * 3);
		x = a = 3, 6 * a;
		int result = (x = a = 3, 6 * a);		
		printf("断点掐到这里方便观察结果\n");	

	}
	
}


// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门提示: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
