// MyProject.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//
//公众号：程序员速成   ，内含优质视频教程，欢迎关注

//#include "stdio.h"  写不写都可以
#include <iostream>


int main() //主函数
{	
	{
		int a[3][4];
		int* p;
		p = (int*)a; //强制类型转换

		p = (int*)(a + 1);

		p = a[0];
		p = a[1];

		p = &a[0][1];
		p = a[0] + 1;


		printf("断点掐到这里\n");
	}
	{
		int a[3][4];
		for (int i = 0; i < 3; i++)
		{
			for (int j = 0; j < 4; j++)
			{
				a[i][j] = 86;
			}
		}
		int* p;

		p = (int*)(a + 1); //第一行首地址(注意最上边一行我们称为第0行)
		*p = 56;  //这个相当于a[1][0]给了56
		p++;      //走四个字节，
		*p = 78;  //这个相当于a[1][1]给了78
		printf("断点掐到这里\n");
	}
	{		
		int a[3][4];
		for (int i = 0; i < 3; i++)
		{
			for (int j = 0; j < 4; j++)
			{
				a[i][j] = 86;
			}
		}
		int* p[4]; //能引用的下标[0]~[3] 
		p[0] = &a[0][0];
		p[1] = &a[0][1];
		p[2] = &a[0][2];
		p[3] = &a[0][3];

		for (int i = 0; i < 4; i++)
		{
			printf("value = %d\n", *p[i]); //value = 86
		}
	}

	{
		int(*p)[10];
		int a[10];
		for (int i = 0; i < 10; i++)
		{
			a[i] = i;
		}
		p = &a; //注意到这里要用&地址符,否则编译会报错
		int* q;
		q = (int*)p; //强制类型转换，如果不转，大家观察编译器会报什么错
		for (int i = 0; i < 10; i++)
		{
			printf("value = %d\n", *q);
			q++;
		}
		p++;    //会跳过40个字节
		printf("断点掐到这里\n");
	}
	{
		int(*p)[10];

		int a[3][10];
		for (int i = 0; i < 3; i++)
		{
			for (int j = 0; j < 10; j++)
			{
				a[i][j] = i + j;
			}
		}

		p = a; //二维数组名可以直接赋值给数组指针
		int* q;
		q = (int*)p;
		for (int i = 0; i < 3; i++)
		{
			for (int j = 0; j < 10; j++)
			{
				printf("%d  ", *q);
				q++;
			}
			printf("-------------\n");

			p++;    //会跳40个字节
			q = (int*)p;
		}

	}
	{
		int(*p)[10];

		int a[3][10];
		for (int i = 0; i < 3; i++)
		{
			for (int j = 0; j < 10; j++)
			{
				a[i][j] = i + j;
			}
		}

		p = a; //二维数组名可以直接赋值给数组指针
		int* q;
		q = (int*)p;
		for (int i = 0; i < 3; i++)
		{
			q = *(p + i);
			for (int j = 0; j < 10; j++)
			{
				printf("%d  ", *q);
				q++;
			}
			printf("-------------\n");
			//p++;    //会跳40个字节
			//q = (int*)p;

		}
	}

	{
		int(*p)[10];

		int a[3][10];
		for (int i = 0; i < 3; i++)
		{
			for (int j = 0; j < 10; j++)
			{
				a[i][j] = i + j;
			}
		}

		p = a; //二维数组名可以直接赋值给数组指针
		int* q;
		q = (int*)p;
		for (int i = 0; i < 3; i++)
		{
			//q =  *(p+i);

			for (int j = 0; j < 10; j++)
			{
				printf("%d  ", *(*(p + i) + j));
				//q++;
			}
			printf("-------------\n");

			//p++;    //会跳40个字节
			//q = (int*)p;		
		}

	}

	return 0;
}


// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门提示: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
